{
  "backend/main.mo": "Main Motoko actor for the CareerSphere backend, defining data types (CareerPath, DegreeProgram, UserProfile, etc.) and implementing user profile management, quiz results, bookmarking, and access-controlled query/update functions.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs and titles to their affected files, related components, test IDs, and confidence levels for route registration and page component fixes.",
  "frontend-file-summaries.txt": "A JSON document containing one-line summaries of each frontend source file, describing their purpose, key UI features, and recent changes for build planning reference.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, card, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the CareerSphere React app, setting the page title and mounting the React root via main.tsx.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with 16 routes (including /subject-to-career and /regional-language), wraps the app in React Query provider, and renders the Toaster notification component.",
  "frontend/src/components/DeleteUserConfirmDialog.tsx": "Alert dialog component that confirms permanent deletion of a user profile by principal, using the useDeleteUserProfile mutation and displaying the principal string with a destructive warning.",
  "frontend/src/components/Footer.tsx": "Responsive footer component displaying a 2026 copyright notice, social media icon links, and a caffeine.ai attribution link with UTM tracking based on the current hostname.",
  "frontend/src/components/Layout.tsx": "Layout wrapper that composes the Navigation header, a main content Outlet, and Footer into a full-height flex column for all pages.",
  "frontend/src/components/ModuleCard.tsx": "A card component that displays a module with an icon, title, description, and an 'Explore' button that navigates to the specified path using TanStack Router.",
  "frontend/src/components/Navigation.tsx": "A sticky top navigation bar with links to Home, Modules, About, Contact, Admin Dashboard, and a conditional Profile/Login link based on Internet Identity authentication status, with a responsive mobile menu.",
  "frontend/src/components/UserDataCard.tsx": "A card component for displaying a summary of a user's data (principal ID, latest quiz result, bookmarks) with View and Delete action buttons.",
  "frontend/src/components/UserDetailsModal.tsx": "A modal dialog that shows full details of a user profile including principal ID, quiz results with stream badges, and bookmarked careers and degrees.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous backend actor using TanStack Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useAdminQueries.ts": "Provides two hooks—`useGetAllUserProfiles` for fetching all user profiles from the backend and `useDeleteUserProfile` for deleting a user by principal—with toast notifications and query cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for backend interactions including submitting quiz results, fetching user profiles, and managing career/degree bookmarks with mutation and cache invalidation logic.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines light/dark theme CSS custom properties using OKLCH color values, plus utility classes for gradient backgrounds.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/About.tsx": "Static About page describing the platform's mission, vision, and the problem it solves for students seeking career guidance.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that fetches and displays all user profiles in a table with options to view details or delete users via modal dialogs.",
  "frontend/src/pages/CareerPath.tsx": "Career exploration page where users select a subject to view related career paths with degrees and exams, and can bookmark or unbookmark careers if logged in.",
  "frontend/src/pages/Chatbot.tsx": "Simple rule-based career guidance chatbot page with a chat UI that responds to keywords about careers, subjects, and entrance exams with simulated bot replies.",
  "frontend/src/pages/Contact.tsx": "A contact page with a validated form (name, email, message) and contact information display (email, phone, address). On successful submission it shows a confirmation and resets the form after 3 seconds.",
  "frontend/src/pages/DegreeFinder.tsx": "A searchable list of Indian undergraduate degree programs with bookmark functionality, requiring authentication via Internet Identity. Users can add/remove bookmarks stored in their profile via React Query mutations.",
  "frontend/src/pages/FutureMap.tsx": "A static visual roadmap page showing four career journey stages (School Subjects → Degree → Career Path → Dream Job) with responsive desktop timeline and vertical mobile layout.",
  "frontend/src/pages/Home.tsx": "The landing/home page featuring a hero section with logo, tagline, and navigation buttons, followed by a features overview section highlighting the platform's key offerings.",
  "frontend/src/pages/IndiaVsAbroad.tsx": "An interactive comparison page that contrasts studying/working in India vs abroad across four categories (cost, ROI, lifestyle, job opportunities) using expandable cards with score bars.",
  "frontend/src/pages/Login.tsx": "Login page supporting Internet Identity authentication and traditional login (unimplemented demo). Shows logged-in state with principal ID, logout option, and benefits of signing in.",
  "frontend/src/pages/Modules.tsx": "Modules listing page that renders a grid of ModuleCard components for all eight career guidance tools available in the app.",
  "frontend/src/pages/Profile.tsx": "User profile page displaying the authenticated user's principal ID, latest Stream Selector quiz results, and bookmarked careers, with redirect to login if unauthenticated.",
  "frontend/src/pages/RegionalLanguage.tsx": "Informational page for the Regional Language Career Platform showcasing supported Indian languages and features like multi-language support and localized content.",
  "frontend/src/pages/StreamResult.tsx": "Results page that displays the recommended academic stream (Science, Commerce, or Arts) along with relevant subjects and career options based on quiz answers passed via URL search params.",
  "frontend/src/pages/StreamSelector.tsx": "Five-question quiz page that determines a recommended academic stream by tallying answers, optionally saves results to the backend via mutation if the user is authenticated, then navigates to the StreamResult page.",
  "frontend/src/pages/SubjectToCareer.tsx": "A React page component for the 'Subject-to-Career AR Explorer' feature that displays a header, description card, three feature cards (Subject Connections, Career Exploration, Future Opportunities), and a 'Coming Soon' banner with purple/indigo gradient styling.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to extract URL parameters from both regular query strings and hash-based routing, persist them to sessionStorage, and clean sensitive parameters from the URL hash without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom OKLCH-based color tokens (primary, secondary, sidebar, chart, etc.), custom border radii, box shadows, and keyframe animations (accordion, fade-in) with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata (version 39) describing CareerSphere, a career guidance web platform with 8 interactive modules, listing architectural notes, known issues (missing module links, logo display, backend persistence), and a catalog of existing implemented features."
}