{
  "kind": "build_request",
  "title": "Fix inaccessible module pages for Subject-to-Career and Regional Language",
  "projectName": "CareerSphere",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-111",
      "text": "Verify and fix the route registration for '/subject-to-career' in frontend/src/App.tsx so that the SubjectToCareer page component is correctly imported and rendered when navigating to that path, following the same pattern as other module routes such as '/career-path' and '/chatbot'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "The module is still not accessible"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /subject-to-career renders the SubjectToCareer page without a 404 or blank screen",
        "The route is registered in App.tsx using the same pattern as existing module routes",
        "The SubjectToCareer component is correctly imported in App.tsx"
      ]
    },
    {
      "id": "REQ-112",
      "text": "Verify and fix the route registration for '/regional-language' in frontend/src/App.tsx so that the RegionalLanguage page component is correctly imported and rendered when navigating to that path, following the same pattern as other module routes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "The module is still not accessible"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /regional-language renders the RegionalLanguage page without a 404 or blank screen",
        "The route is registered in App.tsx using the same pattern as existing module routes",
        "The RegionalLanguage component is correctly imported in App.tsx"
      ]
    },
    {
      "id": "REQ-113",
      "text": "Verify that frontend/src/pages/Modules.tsx passes the correct path props ('subject-to-career' and 'regional-language' respectively, prefixed with '/') to the ModuleCard components for 'Subject-to-Career AR Explorer' and 'Regional Language Career Platform', and fix any incorrect or missing path values.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "The module is still not accessible"
        ]
      },
      "acceptanceCriteria": [
        "The 'Subject-to-Career AR Explorer' ModuleCard has path='/subject-to-career'",
        "The 'Regional Language Career Platform' ModuleCard has path='/regional-language'",
        "Clicking the Explore button on each card navigates to the correct route"
      ]
    },
    {
      "id": "REQ-114",
      "text": "Ensure frontend/src/pages/SubjectToCareer.tsx exists as a valid React component that exports a default component. If the file is missing or malformed, recreate it with a header, description explaining how subjects connect to career paths, and a 'coming soon' notice for AR features, styled consistently with the existing module pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "The module is still not accessible"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/pages/SubjectToCareer.tsx exists and exports a valid default React component",
        "The page displays a header, a brief description, and a coming-soon placeholder section",
        "The page uses the same gradient and card styling patterns as other module pages"
      ]
    },
    {
      "id": "REQ-115",
      "text": "Ensure frontend/src/pages/RegionalLanguage.tsx exists as a valid React component that exports a default component. If the file is missing or malformed, recreate it with a header, description explaining how the platform helps students explore careers in their regional language, and a 'coming soon' status indicator, styled consistently with SubjectToCareer.tsx.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "The module is still not accessible"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/pages/RegionalLanguage.tsx exists and exports a valid default React component",
        "The page displays a header, a brief description about regional language career guidance, and a coming-soon placeholder",
        "The page uses the same gradient and card styling patterns as SubjectToCareer.tsx"
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths",
    "Do not change any existing working module routes or page components",
    "Follow the existing TanStack Router route registration pattern found in frontend/src/App.tsx"
  ],
  "nonGoals": [
    "Implementing actual AR features for Subject-to-Career module",
    "Implementing actual regional language content or translations",
    "Changes to backend logic",
    "Modifying any other pages or components not related to these two module routes"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}