{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix inaccessible module pages for Subject-to-Career and Regional Language",
  "requirements": [
    {
      "id": "REQ-111",
      "summary": "Fix route registration for '/subject-to-career' in App.tsx to ensure SubjectToCareer page renders correctly",
      "acceptanceCriteria": [
        "Navigating to /subject-to-career renders the SubjectToCareer page without a 404 or blank screen",
        "The route is registered in App.tsx using the same pattern as existing module routes",
        "The SubjectToCareer component is correctly imported in App.tsx"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify that the '/subject-to-career' route is correctly registered in the TanStack Router configuration. Import SubjectToCareer component if missing. Ensure the route definition follows the same pattern as existing module routes like '/career-path' and '/chatbot', with proper path, component, and element configuration."
        }
      ]
    },
    {
      "id": "REQ-112",
      "summary": "Fix route registration for '/regional-language' in App.tsx to ensure RegionalLanguage page renders correctly",
      "acceptanceCriteria": [
        "Navigating to /regional-language renders the RegionalLanguage page without a 404 or blank screen",
        "The route is registered in App.tsx using the same pattern as existing module routes",
        "The RegionalLanguage component is correctly imported in App.tsx"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify that the '/regional-language' route is correctly registered in the TanStack Router configuration. Import RegionalLanguage component if missing. Ensure the route definition follows the same pattern as other module routes, with proper path, component, and element configuration."
        }
      ]
    },
    {
      "id": "REQ-113",
      "summary": "Fix path props in Modules.tsx for Subject-to-Career and Regional Language ModuleCard components",
      "acceptanceCriteria": [
        "The 'Subject-to-Career AR Explorer' ModuleCard has path='/subject-to-career'",
        "The 'Regional Language Career Platform' ModuleCard has path='/regional-language'",
        "Clicking the Explore button on each card navigates to the correct route"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Modules.tsx",
          "operation": "modify",
          "description": "Verify and fix the path props for the 'Subject-to-Career AR Explorer' and 'Regional Language Career Platform' ModuleCard components in the grid of 8 career guidance tool cards. Ensure the Subject-to-Career card has path='/subject-to-career' and the Regional Language card has path='/regional-language', matching the route paths defined in App.tsx."
        }
      ]
    },
    {
      "id": "REQ-114",
      "summary": "Ensure SubjectToCareer.tsx exists as a valid React component with proper content and styling",
      "acceptanceCriteria": [
        "frontend/src/pages/SubjectToCareer.tsx exists and exports a valid default React component",
        "The page displays a header, a brief description, and a coming-soon placeholder section",
        "The page uses the same gradient and card styling patterns as other module pages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SubjectToCareer.tsx",
          "operation": "modify",
          "description": "Verify that SubjectToCareer.tsx exports a valid default React component. According to the file summary, this page already exists as an informational page for the Subject-to-Career AR Explorer feature with feature cards and a coming-soon notice. Ensure it includes a header, description explaining how subjects connect to career paths, a coming-soon notice for AR features, and uses consistent gradient and card styling matching other module pages like StreamSelector.tsx and CareerPath.tsx. Reference the AR explorer icon asset at frontend/public/assets/generated/icon-ar-explorer.dim_128x128.png if needed for visual consistency."
        }
      ]
    },
    {
      "id": "REQ-115",
      "summary": "Ensure RegionalLanguage.tsx exists as a valid React component with proper content and styling",
      "acceptanceCriteria": [
        "frontend/src/pages/RegionalLanguage.tsx exists and exports a valid default React component",
        "The page displays a header, a brief description about regional language career guidance, and a coming-soon placeholder",
        "The page uses the same gradient and card styling patterns as SubjectToCareer.tsx"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RegionalLanguage.tsx",
          "operation": "create",
          "description": "Create RegionalLanguage.tsx as a valid React component that exports a default component. Include a header, description explaining how the platform helps students explore careers in their regional language, and a coming-soon status indicator. Use the same gradient and card styling patterns as SubjectToCareer.tsx to maintain visual consistency. Reference the regional language icon asset at frontend/public/assets/generated/icon-regional-language.dim_128x128.png for the page header or hero section."
        }
      ]
    }
  ]
}