{
  "backend/main.mo": "Motoko actor defining types and functions for quiz results, career paths, degree programs, and user profiles with bookmark management, including methods to submit quiz results, fetch user profiles, and manage bookmarks.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: auto-saving quiz results, bookmark buttons on career/degree pages, profile dashboard creation, and enhanced login page with authentication benefits.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, hooks, and configuration, describing UI elements, routing, authentication integration, and bookmark functionality across the application.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark modes, including primary, secondary, muted, accent, and sidebar color tokens.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, CareerSphere title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with 12 routes (home, modules, career-path, stream-selector, profile, login, etc.), React Query client, and Toaster for notifications.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice, social media links (Facebook, X, LinkedIn, Instagram, GitHub), and caffeine.ai attribution with UTM tracking parameters.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component rendering Navigation header, main content area with Outlet for nested routes, and Footer in a flex column structure.",
  "frontend/src/components/ModuleCard.tsx": "Reusable card component displaying module icon, title, description, and explore button with hover animations and navigation to specified path.",
  "frontend/src/components/Navigation.tsx": "Navigation component with responsive desktop/mobile menu, route highlighting, and conditional rendering of login/profile links based on Internet Identity authentication state.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor instance based on Internet Identity state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient configuration with delegation handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including quiz submission, user profile management, and bookmark CRUD operations with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, plus utility classes for gradient effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrappers around the main App component.",
  "frontend/src/pages/About.tsx": "Static About page describing CareerSphere's mission, vision, and the problem it solves for students seeking career guidance, with animated card layouts.",
  "frontend/src/pages/CareerPath.tsx": "Career exploration page that allows users to select subjects and view related careers with degree and exam requirements. Includes bookmark functionality for authenticated users to save careers of interest.",
  "frontend/src/pages/Chatbot.tsx": "AI career assistant chatbot interface with predefined responses for career guidance, skill assessment, stream selection, and exam information. Features a scrollable message history and real-time conversation simulation.",
  "frontend/src/pages/Contact.tsx": "Contact page with a form for user inquiries and static contact information display (email, phone, address). Includes form validation and success feedback.",
  "frontend/src/pages/DegreeFinder.tsx": "Degree search and discovery page displaying various undergraduate programs with duration, entrance exams, fees, and descriptions. Supports search filtering and bookmark functionality for authenticated users.",
  "frontend/src/pages/FutureMap.tsx": "Visual career journey roadmap showing progression from school subjects through degree selection to career achievement. Features responsive timeline layout with stage descriptions and examples.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section, feature cards, and call-to-action buttons navigating to modules and about pages. Displays benefits like personalized guidance, comprehensive resources, and expert insights.",
  "frontend/src/pages/IndiaVsAbroad.tsx": "Comparison page showing side-by-side analysis of studying in India vs abroad across categories like cost, ROI, lifestyle, and job opportunities with visual score bars.",
  "frontend/src/pages/Login.tsx": "Authentication page supporting Internet Identity login with benefits display (save progress, bookmark careers, track journey) and logout functionality for authenticated users.",
  "frontend/src/pages/Modules.tsx": "Module listing page displaying eight career guidance tools as cards including career path suggestions, stream selector, chatbot, degree finder, and AR explorer.",
  "frontend/src/pages/Profile.tsx": "User profile page showing principal ID, latest stream selector quiz results, and bookmarked careers; requires Internet Identity authentication and redirects to login if not authenticated.",
  "frontend/src/pages/StreamResult.tsx": "Results page displaying recommended stream (Science/Commerce/Arts) from quiz with description, key subjects, and career opportunities based on URL search parameter.",
  "frontend/src/pages/StreamSelector.tsx": "React component implementing a 5-question quiz to suggest academic streams (Science, Commerce, Arts) with navigation, progress tracking, and optional authenticated result submission using Internet Identity and backend mutation hooks.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color system using OKLCH color space, extended theme with sidebar/chart colors, custom border radius variables, shadow utilities, and accordion/fade-in animations.",
  "project_state.json": "Project metadata describing CareerSphere as a career guidance platform with 8 interactive modules, tracking implemented features including landing page, module cards, career path selector, stream quiz, India vs Abroad comparison, and chatbot interface."
}