{
  "backend/main.mo": "Main Motoko actor implementing career guidance backend with access control, user profiles, quiz results, career paths, degree programs, and bookmark management. Includes CRUD operations for careers/degrees and admin functions for user management.",
  "feature_evidence.json": "Feature evidence report documenting two deployment-related features: production IC deployment with permanent .ic0.app URL and 24/7 accessibility verification without platform login.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration, describing responsive layouts, Internet Identity integration, and mobile-first design patterns.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for background, foreground, primary, secondary, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title \"CareerSphere - Your Career Path Navigator\", and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with 14 routes (home, modules, career-path, stream-selector, stream-result, india-vs-abroad, chatbot, futuremap, degree-finder, about, contact, login, profile, admin) and React Query provider with 5-minute stale time and retry: 1.",
  "frontend/src/components/DeleteUserConfirmDialog.tsx": "Alert dialog component for confirming user profile deletion with principal display, warning message about permanent data loss, and integration with useDeleteUserProfile mutation hook.",
  "frontend/src/components/Footer.tsx": "Responsive footer component with copyright text, social media links (Facebook, X, LinkedIn, Instagram, GitHub), and caffeine.ai attribution with UTM tracking parameters.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component rendering Navigation header, main content area with Outlet for nested routes, and Footer in a flex column structure.",
  "frontend/src/components/ModuleCard.tsx": "Reusable card component displaying module icon, title, description, and \"Explore\" button with hover animations, gradient background, and navigation to specified path.",
  "frontend/src/components/Navigation.tsx": "Navigation component with responsive mobile/desktop menus, route highlighting, and conditional rendering of login/profile links based on Internet Identity authentication state.",
  "frontend/src/components/UserDataCard.tsx": "Card component displaying user profile summary including principal ID, latest quiz results, and bookmark counts with view/delete action buttons.",
  "frontend/src/components/UserDetailsModal.tsx": "Modal dialog component that displays detailed user profile information including principal ID, quiz results history, bookmarked careers, and bookmarked degrees in a scrollable view.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAdminQueries.ts": "React Query hooks for admin operations including fetching all user profiles and deleting user profiles with error handling for unauthorized access.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and providing login/logout functionality using @dfinity/auth-client.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profile operations including submitting quiz results, fetching user profiles, and managing career bookmarks (add/remove/fetch).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a soft blue/purple gradient theme for both light and dark modes, including colors for UI components, charts, and sidebar elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/About.tsx": "About page component displaying the platform's mission, vision, problem statement, and purpose of providing career guidance to students with animated cards and gradient styling.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays all user profiles in a table/card view with functionality to view user details, delete users, and shows total user count statistics.",
  "frontend/src/pages/CareerPath.tsx": "Career exploration page where users select subjects to view related career options with degree requirements and entrance exams, includes bookmark functionality for authenticated users.",
  "frontend/src/pages/Chatbot.tsx": "Interactive chatbot interface for career guidance that responds to user queries about careers, exams, and educational paths with predefined response logic based on keywords.",
  "frontend/src/pages/Contact.tsx": "Contact page with a form for user inquiries (name, email, message) including validation, and displays contact information (email, phone, address) with icon cards.",
  "frontend/src/pages/DegreeFinder.tsx": "Displays a searchable list of undergraduate degrees (B.Tech, MBBS, B.Com, etc.) with details on duration, entrance exams, fees, and descriptions. Allows authenticated users to bookmark/unbookmark degrees using Internet Identity and React Query hooks.",
  "frontend/src/pages/FutureMap.tsx": "Visualizes a four-stage career journey roadmap (School Subjects → Degree Selection → Career Path → Dream Job) with responsive layouts: horizontal timeline for desktop and vertical cards for mobile/tablet.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section promoting career guidance platform, featuring call-to-action buttons to modules and about pages, plus a features overview section highlighting platform benefits.",
  "frontend/src/pages/IndiaVsAbroad.tsx": "Compares career opportunities between India and abroad across four categories (Cost, ROI, Lifestyle, Job Opportunities) with expandable cards showing scores and detailed descriptions for each location.",
  "frontend/src/pages/Login.tsx": "Authentication page supporting Internet Identity login with conditional rendering: shows login benefits and II button when logged out, displays principal ID and logout option when authenticated.",
  "frontend/src/pages/Modules.tsx": "Grid layout displaying eight career guidance modules (Career Path, Stream Selector, Chatbot, etc.) as clickable cards with icons, titles, descriptions, and navigation paths.",
  "frontend/src/pages/Profile.tsx": "User profile page that displays authenticated user's principal ID, latest quiz results with recommended stream, and bookmarked careers. Includes logout functionality and redirects to login if not authenticated.",
  "frontend/src/pages/StreamResult.tsx": "Displays the recommended educational stream (Science/Commerce/Arts) result from the quiz, showing stream description, key subjects, and potential career paths. Includes navigation to explore careers and retake the quiz.",
  "frontend/src/pages/StreamSelector.tsx": "Interactive multi-question quiz component that determines recommended educational stream based on user answers about subjects, career interests, problem-solving style, activities, and skills. Saves results to backend if authenticated and navigates to results page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, extended animations (accordion, fade-in), custom shadows, and responsive container settings with typography and animation plugins.",
  "project_state.json": "Project state file tracking CareerSphere web platform with 8 interactive career guidance modules for students. Documents known issues with quiz results not displaying in admin panel and deployment errors, plus 13 completed features including landing page, module cards, career path selector, stream quiz, comparison tools, chatbot, degree finder, and admin dashboard."
}