{
  "backend/main.mo": "Main Motoko actor implementing career guidance system with access control, user profiles, career paths, degree programs, quiz results, and bookmark management. Includes CRUD operations for career/degree data and user profile management with role-based authorization.",
  "feature_evidence.json": "Feature evidence report documenting three logo repositioning tasks: Navigation.tsx logo placement with spacing, Home.tsx hero section logo centering, and logo file path verification with proper asset references.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, and configuration, detailing responsive design patterns, layout structures, and component-specific implementations across the application.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes, including background, foreground, primary, secondary, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, CareerSphere title, and root div mounting the React application via main.tsx module script.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with 14 routes (home, modules, career paths, admin, etc.), React Query client with 5-minute stale time, and Toaster for notifications.",
  "frontend/src/components/DeleteUserConfirmDialog.tsx": "Alert dialog component for confirming user profile deletion with principal display, warning message, and mutation handling via useDeleteUserProfile hook with 44px minimum button height.",
  "frontend/src/components/Footer.tsx": "Responsive footer component with copyright text, five social media icon links (Facebook, X, LinkedIn, Instagram, GitHub), and caffeine.ai attribution with UTM tracking parameters.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component rendering Navigation header, Outlet for route content, and Footer in a flex column structure with min-height viewport.",
  "frontend/src/components/ModuleCard.tsx": "Reusable card component displaying module icon, title, description, and explore button with hover animations, responsive sizing, and navigation to specified path with 44px minimum button height.",
  "frontend/src/components/Navigation.tsx": "Main navigation component with responsive mobile/desktop menus, displaying links to Home, Modules, About, Contact, Admin Dashboard, and conditional Profile/Login links based on Internet Identity authentication status.",
  "frontend/src/components/UserDataCard.tsx": "Card component displaying user profile summary including truncated Principal ID, latest quiz result with completion percentage, bookmark counts, and action buttons for viewing details and deleting the user.",
  "frontend/src/components/UserDetailsModal.tsx": "Modal dialog component showing comprehensive user profile details including full Principal ID, all quiz results with selected streams and completion percentage, bookmarked careers, and bookmarked degrees in a scrollable view.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication with Internet Identity, initializing access control with admin token from URL params, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminQueries.ts": "Admin-specific React Query hooks for fetching all user profiles and deleting user profiles, with error handling for unauthorized access and automatic query invalidation on successful mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profile operations including submitting quiz results, fetching user profile, adding/removing career bookmarks, and retrieving bookmarked careers with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a soft blue/purple gradient theme for both light and dark modes, including colors for UI components, charts, and sidebar elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/About.tsx": "About page component displaying the platform's mission, vision, problem statement, and purpose of providing career guidance to students through cards with icons and gradient styling.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays all user profiles in a table/card view with functionality to view user details, delete users, and shows total user count statistics.",
  "frontend/src/pages/CareerPath.tsx": "Career exploration page where users select subjects to view related career options with required degrees and exams, includes bookmark functionality for authenticated users.",
  "frontend/src/pages/Chatbot.tsx": "Interactive chatbot interface for career guidance that responds to user queries about careers, exams, and educational paths with predefined response logic based on keywords.",
  "frontend/src/pages/Contact.tsx": "Contact page with a form for user inquiries (name, email, message) including validation, and displays contact information (email, phone, address) with icon cards.",
  "frontend/src/pages/DegreeFinder.tsx": "Displays a searchable list of undergraduate degrees (B.Tech, MBBS, B.Com, etc.) with details on duration, entrance exams, fees, and descriptions. Allows authenticated users to bookmark degrees using Internet Identity and backend mutations.",
  "frontend/src/pages/FutureMap.tsx": "Visualizes a four-stage career journey roadmap (School Subjects → Degree Selection → Career Path → Dream Job) with responsive layouts: horizontal timeline for desktop and vertical cards for mobile/tablet.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section featuring logo, call-to-action buttons to modules and about pages, and a features overview section showcasing career guidance tools.",
  "frontend/src/pages/IndiaVsAbroad.tsx": "Compares career opportunities in India vs abroad across four categories (cost, ROI, lifestyle, jobs) with expandable cards showing scores and detailed descriptions for each location.",
  "frontend/src/pages/Login.tsx": "Handles Internet Identity authentication with conditional rendering: shows login benefits and II login button when logged out, displays principal ID and logout/profile navigation when logged in.",
  "frontend/src/pages/Modules.tsx": "Grid layout displaying eight career guidance modules (Career Path, India vs Abroad, Stream Selector, AI Chatbot, etc.) as clickable cards with icons, titles, descriptions, and navigation paths.",
  "frontend/src/pages/Profile.tsx": "User profile page that displays authenticated user's principal ID, latest quiz results with recommended stream, and bookmarked careers. Includes logout functionality and redirects to login if not authenticated.",
  "frontend/src/pages/StreamResult.tsx": "Displays the recommended educational stream (Science/Commerce/Arts) result with description, key subjects, and potential career paths. Includes navigation to explore careers and retake the quiz.",
  "frontend/src/pages/StreamSelector.tsx": "Interactive quiz component with 5 questions to determine recommended educational stream (Science/Commerce/Arts). Calculates results based on answers, saves to backend if authenticated, and navigates to results page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended animations (accordion, fade-in), custom shadows, and responsive container settings.",
  "project_state.json": "Project state tracking file for CareerSphere, a career guidance web platform with 8 interactive modules for students. Documents known issues including quiz results not displaying in admin panel, deployment errors, and logo display problems in Navigation component."
}