{
  "backend/main.mo": "Empty Motoko actor definition serving as the backend entry point.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including landing page, modules section, career path page, stream selector quiz, and their associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their purpose, including pages, components, and configuration files.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining light and dark mode theme variables for the application.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the React application titled 'CareerSphere'.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with 12 routes (Home, Modules, Career Path, Stream Selector, Stream Result, India vs Abroad, Chatbot, FutureMap, Degree Finder, About, Contact, Login) wrapped in Layout.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, social media links (Facebook, X, LinkedIn, Instagram, GitHub), and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component rendering Navigation header, main content area with Outlet for route rendering, and Footer.",
  "frontend/src/components/ModuleCard.tsx": "Reusable card component displaying module icon, title, description, and explore button with hover animations and navigation.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation header with CareerSphere logo, desktop/mobile menu toggle, active route highlighting, and gradient styling.",
  "frontend/src/hooks/useActor.ts": "Custom React hook managing backend actor creation with Internet Identity authentication, query caching, and automatic invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and context provider for Internet Identity authentication on ICP, managing login state, identity storage, and delegation validation with AuthClient integration.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using a soft blue-purple gradient color scheme and OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/About.tsx": "About page component describing CareerSphere's mission to provide career guidance for students, explaining the problem it solves and the platform's vision.",
  "frontend/src/pages/CareerPath.tsx": "Interactive career path suggestion page where users select a subject to view related careers, required degrees, and entrance exams.",
  "frontend/src/pages/Chatbot.tsx": "AI career assistant chatbot interface with simulated bot responses providing guidance on skills, careers, streams, exams, and study abroad options.",
  "frontend/src/pages/Contact.tsx": "Contact form page with validation for name, email, and message fields, displaying contact information including email, phone, and address.",
  "frontend/src/pages/DegreeFinder.tsx": "Displays a searchable list of degree programs (B.Tech, MBBS, B.Com, etc.) with details on duration, entrance exams, fees, and descriptions. Uses a search input to filter degrees by name or description.",
  "frontend/src/pages/FutureMap.tsx": "Visualizes a four-stage career journey roadmap from school subjects to dream job with icons and examples. Includes responsive desktop timeline and mobile vertical layout with animated stages.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section, call-to-action buttons, and features overview highlighting personalized guidance. Includes navigation to modules and about pages with gradient styling and animations.",
  "frontend/src/pages/IndiaVsAbroad.tsx": "Compares career opportunities between India and abroad across four categories (cost, ROI, lifestyle, jobs) with scores and progress bars. Each comparison shows values, descriptions, and visual score indicators.",
  "frontend/src/pages/Login.tsx": "Authentication page supporting Internet Identity login with traditional email/password form as UI-only placeholder. Displays login status and user principal when authenticated.",
  "frontend/src/pages/Modules.tsx": "Grid layout displaying eight career guidance module cards with icons, titles, descriptions, and navigation paths. Includes staggered fade-in animations for each module card.",
  "frontend/src/pages/StreamResult.tsx": "Displays the recommended stream (Science/Commerce/Arts) result page with stream description, key subjects, career opportunities, and navigation to explore more modules or retake the quiz.",
  "frontend/src/pages/StreamSelector.tsx": "Interactive quiz component with 5 questions to determine the ideal stream for 10th-grade students, tracking answers and calculating results based on Science/Commerce/Arts preferences.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, extended shadows, animations (accordion, fade-in), and responsive container settings for the CareerSphere design system.",
  "project_state.json": "Project metadata for CareerSphere career guidance platform, documenting 8 interactive modules, architectural notes about responsive design with soft gradient colors, navigation structure, and required image assets for module cards."
}