{
  "backend/main.mo": "Main Motoko actor implementing career guidance system with access control, user profiles, quiz results, career paths, degree programs, and bookmark management with CRUD operations and authorization checks.",
  "feature_evidence.json": "Feature evidence report documenting the replacement of 'career guide' text with 'CareerSphere' across frontend components, linked to test ID REQ-79 with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing responsive layouts, navigation, pages, hooks, and component implementations with OKLCH color system and touch-friendly UI patterns.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes, defining design tokens for backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with viewport meta tag and title 'CareerSphere - Your Career Path Navigator', loading React app from main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with 14 routes (home, modules, career-path, admin, etc.) and React Query client with 5-minute stale time and retry settings.",
  "frontend/src/components/DeleteUserConfirmDialog.tsx": "Alert dialog component for admin user deletion with principal display, warning message, and mutation handling using useDeleteUserProfile hook with 44px minimum button height.",
  "frontend/src/components/Footer.tsx": "Responsive footer with copyright '© 2026 CareerSphere', social media icons (Facebook, X, LinkedIn, Instagram, GitHub), and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Layout.tsx": "Layout wrapper rendering Navigation header, main content area with TanStack Router Outlet, and Footer in a flex column structure.",
  "frontend/src/components/ModuleCard.tsx": "Reusable card component displaying module icon, title, description, and 'Explore' button with hover animations, responsive sizing, and 44px minimum touch target.",
  "frontend/src/components/Navigation.tsx": "Navigation component with sticky header, responsive mobile menu, and links to main pages (Home, Modules, About, Contact, Admin Dashboard). Displays user authentication state with conditional Profile/Login links and uses Internet Identity for auth.",
  "frontend/src/components/UserDataCard.tsx": "Card component displaying user profile summary including Principal ID, latest quiz result with completion percentage, and bookmark counts. Provides View and Delete action buttons.",
  "frontend/src/components/UserDetailsModal.tsx": "Modal dialog showing detailed user profile information including full Principal ID, all quiz results with selected streams and completion percentage, bookmarked careers, and bookmarked degrees in a scrollable view.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication. Automatically recreates actor when identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useAdminQueries.ts": "Admin-specific React Query hooks for fetching all user profiles and deleting user profiles. Handles unauthorized access gracefully and shows toast notifications on success/error.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication using @dfinity/auth-client. Manages login state, identity persistence, and provides login/logout functions with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profile operations including submitting quiz results, fetching user profile, and managing career bookmarks (add/remove/fetch). All mutations invalidate relevant queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a soft blue/purple gradient theme for both light and dark modes, including colors for UI components, charts, and sidebar elements.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/About.tsx": "About page component displaying the platform's mission, vision, problem statement, and purpose of providing career guidance to students with animated card layouts.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays all user profiles in a table/card view with functionality to view user details and delete users, using custom hooks for data fetching.",
  "frontend/src/pages/CareerPath.tsx": "Career exploration page where users select subjects to view related career options with degrees and exams, featuring bookmark functionality for authenticated users.",
  "frontend/src/pages/Chatbot.tsx": "Interactive chatbot interface for career guidance that simulates bot responses based on user queries about careers, exams, and academic fields with a message history display.",
  "frontend/src/pages/Contact.tsx": "Contact page with a form for user inquiries (name, email, message) including validation, and displays contact information (email, phone, address) in card layouts.",
  "frontend/src/pages/DegreeFinder.tsx": "Displays a searchable list of undergraduate degrees (B.Tech, MBBS, B.Com, etc.) with details on duration, entrance exams, fees, and descriptions. Supports authenticated bookmark functionality for saving degrees to user profiles.",
  "frontend/src/pages/FutureMap.tsx": "Visualizes a four-stage career journey roadmap (School Subjects → Degree Selection → Career Path → Dream Job) with responsive layouts for desktop (horizontal timeline) and mobile/tablet (vertical timeline).",
  "frontend/src/pages/Home.tsx": "Landing page with hero section promoting career guidance platform, featuring call-to-action buttons to modules and about pages, plus a features overview section highlighting platform benefits.",
  "frontend/src/pages/IndiaVsAbroad.tsx": "Compares career opportunities between India and abroad across four categories (Cost, ROI, Lifestyle, Job Opportunities) with expandable cards showing scored comparisons and detailed descriptions.",
  "frontend/src/pages/Login.tsx": "Authentication page supporting Internet Identity login with conditional rendering for logged-in/logged-out states, displaying benefits of authentication (save progress, bookmarks, tracking) and logout functionality.",
  "frontend/src/pages/Modules.tsx": "Grid layout displaying eight career guidance modules (Career Path, India vs Abroad, Stream Selector, AI Chatbot, FutureMap, etc.) as navigable cards with icons, titles, and descriptions.",
  "frontend/src/pages/Profile.tsx": "User profile page that displays authenticated user's principal ID, latest quiz results, and bookmarked careers with logout functionality. Redirects to login if not authenticated and shows loading states during data fetching.",
  "frontend/src/pages/StreamResult.tsx": "Displays the recommended educational stream (Science/Commerce/Arts) with description, key subjects, and career options. Receives stream parameter from URL search and provides navigation to explore careers.",
  "frontend/src/pages/StreamSelector.tsx": "Interactive quiz component with 5 questions to determine recommended educational stream based on user preferences. Calculates results, saves to backend if authenticated, and navigates to results page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support. Includes functions to get, store, clear, and persist parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom shadows, animations (accordion, fade-in), and responsive container settings. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file tracking CareerSphere web platform with 8 interactive career guidance modules for students. Documents known issues with quiz results not displaying in admin panel and deployment errors, plus 13 implemented features including landing page, module cards, career path selector, stream quiz, comparison tools, chatbot, and admin dashboard."
}