{
  "backend/main.mo": "Main Motoko actor implementing career guidance system with access control, user profiles, quiz results, career paths, degree programs, and bookmark management. Includes CRUD operations for career/degree data and user profile management with authorization checks.",
  "feature_evidence.json": "Feature evidence report documenting three completed features for the Subject-to-Career AR Explorer module: page component creation, route addition, and module card path update.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including styling, routing, components, and pages with details about responsive design, navigation, and the Subject-to-Career route integration.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark themes with neutral grayscale palette and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'CareerSphere - Your Career Path Navigator', and root div mounting the React app from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with 15 routes (including /subject-to-career), React Query client with 5-minute stale time, and Toaster for notifications.",
  "frontend/src/components/DeleteUserConfirmDialog.tsx": "Alert dialog component for confirming user profile deletion with principal display, warning message, and mutation handling using useDeleteUserProfile hook.",
  "frontend/src/components/Footer.tsx": "Responsive footer component with copyright text, social media icon links (Facebook, X, LinkedIn, Instagram, GitHub), and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper component rendering Navigation header, main content area with TanStack Router Outlet, and Footer in a flex column structure.",
  "frontend/src/components/ModuleCard.tsx": "A card component that displays a module with an icon, title, description, and an \"Explore\" button that navigates to the module's path. Features hover animations and responsive styling.",
  "frontend/src/components/Navigation.tsx": "Main navigation component with sticky header, responsive mobile menu, and links to Home, Modules, About, Contact, Admin Dashboard, and Profile/Login. Integrates with Internet Identity for authentication state.",
  "frontend/src/components/UserDataCard.tsx": "Displays a user's profile data in a card format, showing principal ID, latest quiz results, and bookmark counts. Includes View and Delete action buttons.",
  "frontend/src/components/UserDetailsModal.tsx": "A modal dialog that shows detailed user profile information including principal ID, quiz results with completion percentage, bookmarked careers, and bookmarked degrees in a scrollable view.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminQueries.ts": "Provides React Query hooks for admin operations: fetching all user profiles with detailed logging and deleting user profiles with toast notifications. Handles unauthorized access gracefully.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login, logout, and status tracking functionality.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile operations including submitting quiz results, fetching user profiles, and managing bookmarks (add/remove) for careers and degrees with extensive logging.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using OKLCH color space, featuring a soft blue-purple gradient theme and custom utility classes for gradients.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/About.tsx": "About page component displaying mission, vision, problem statement, and team information with animated cards and gradient styling.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays all user profiles in a table with view/delete actions, includes modals for user details and delete confirmation, with extensive console logging.",
  "frontend/src/pages/CareerPath.tsx": "Career exploration page allowing users to select subjects and view related careers with degrees and exams, includes bookmark functionality requiring authentication.",
  "frontend/src/pages/Chatbot.tsx": "Interactive chatbot interface with simulated bot responses providing career guidance based on keyword matching in user messages, featuring a scrollable message history.",
  "frontend/src/pages/Contact.tsx": "Contact page component with a form for name, email, and message fields, including validation and submission handling. Displays contact information (email, phone, location) with icons in a two-column layout.",
  "frontend/src/pages/DegreeFinder.tsx": "Degree finder page that displays a searchable list of 8 Indian undergraduate degrees (B.Tech, MBBS, B.Com, etc.) with details on duration, entrance exams, fees, and descriptions. Includes bookmark functionality integrated with Internet Identity authentication and user profile queries.",
  "frontend/src/pages/FutureMap.tsx": "Career journey visualization page showing a 4-stage roadmap from school subjects to dream job with icons and examples. Features responsive design with horizontal timeline for desktop and vertical layout for mobile/tablet.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section featuring CareerSphere branding, call-to-action buttons to modules and about pages, and a features overview section. Uses gradient backgrounds, animations, and responsive layout with logo and hero image.",
  "frontend/src/pages/IndiaVsAbroad.tsx": "Comparison page analyzing career opportunities in India versus abroad across 4 categories (cost, ROI, lifestyle, job opportunities) with score bars and expandable descriptions. Features interactive category selection with animated transitions.",
  "frontend/src/pages/Login.tsx": "Login page component that handles Internet Identity authentication, displays login benefits, and shows logged-in state with user principal ID and logout functionality.",
  "frontend/src/pages/Modules.tsx": "Modules overview page that displays a grid of 8 career guidance tool cards including Stream Selector, Career Path, Degree Finder, and other educational modules.",
  "frontend/src/pages/Profile.tsx": "User profile page that displays authenticated user's principal ID, latest Stream Selector quiz results, and bookmarked careers with logout functionality.",
  "frontend/src/pages/StreamResult.tsx": "Stream recommendation results page that displays the suggested stream (Science/Commerce/Arts) with associated subjects, careers, and next steps based on quiz completion.",
  "frontend/src/pages/StreamSelector.tsx": "Interactive quiz component with 5 questions to determine recommended academic stream, saves results for authenticated users via backend mutation, and navigates to results page.",
  "frontend/src/pages/SubjectToCareer.tsx": "Static informational page describing the Subject-to-Career AR Explorer feature with feature cards and a 'coming soon' status indicator.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, custom shadows, and keyframe animations for accordion and fade-in effects.",
  "project_state.json": "Project state file documenting CareerSphere, a career guidance platform with 8 modules, tracking architectural decisions, known issues (logo display, quiz persistence, deployment errors), and implemented features with their requirement IDs."
}