{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add user authentication with progress saving",
  "requirements": [
    {
      "id": "REQ-15",
      "summary": "Auto-save quiz results when authenticated user completes Stream Selector Quiz",
      "acceptanceCriteria": [
        "Quiz results are saved to backend after completion if user is logged in",
        "Show success message after saving results",
        "Handle cases where user is not authenticated with a prompt to log in"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StreamSelector.tsx",
          "operation": "modify",
          "description": "Integrate backend quiz result submission using submitQuizResults from useActor hook. After calculating quiz results, check authentication status via useInternetIdentity and call submitQuizResults with selectedStreams array and completionPercentage. Display success toast/message on save completion. If user is not authenticated, show prompt to log in before navigating to results. Handle loading and error states during save operation."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Add bookmark functionality to Career Path page for authenticated users",
      "acceptanceCriteria": [
        "Bookmark icon button appears on each career card",
        "Clicking bookmark saves the career to backend and shows visual feedback",
        "Bookmarked careers display a filled bookmark icon",
        "Prompt to log in if user is not authenticated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CareerPath.tsx",
          "operation": "modify",
          "description": "Add bookmark button with heart or bookmark icon to each career card. Use useActor hook to access addBookmark and removeBookmark backend functions. Fetch bookmarked career IDs from getUserProfile to display filled/unfilled bookmark state. On bookmark click, check authentication status and either call addBookmark/removeBookmark or prompt user to log in. Show visual feedback (icon state change, toast message) on successful bookmark action. Handle loading states during API calls."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Add bookmark functionality to Degree Finder page for authenticated users",
      "acceptanceCriteria": [
        "Bookmark icon button appears on each degree card",
        "Clicking bookmark saves the degree to backend and shows visual feedback",
        "Bookmarked degrees display a filled bookmark icon",
        "Prompt to log in if user is not authenticated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DegreeFinder.tsx",
          "operation": "modify",
          "description": "Add bookmark button with heart or bookmark icon to each degree card. Use useActor hook to access addBookmark and removeBookmark backend functions. Fetch bookmarked degree IDs from getUserProfile to display filled/unfilled bookmark state. On bookmark click, check authentication status and either call addBookmark/removeBookmark or prompt user to log in. Show visual feedback (icon state change, toast message) on successful bookmark action. Handle loading states during API calls."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Create Profile/Dashboard page displaying saved progress and bookmarks",
      "acceptanceCriteria": [
        "Profile page shows user principal ID and join date",
        "Section displaying saved Stream Selector quiz results with recommended stream",
        "Section showing bookmarked careers with links to Career Path page",
        "Section showing bookmarked degrees with links to Degree Finder page",
        "Navigation menu includes 'Profile' or 'My Progress' link",
        "Redirect to login page if user is not authenticated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Profile.tsx",
          "operation": "create",
          "description": "Create new Profile page component that fetches user data via getUserProfile and getBookmarkedCareers from useActor hook. Check authentication status using useInternetIdentity and redirect to login if not authenticated. Display user principal ID prominently at top. Create sections for: (1) Quiz Results showing selectedStreams and completionPercentage from quizResults array, (2) Bookmarked Careers displaying career cards with titles and navigation links to Career Path page, (3) Bookmarked Degrees showing degree cards with links to Degree Finder page. Include loading states and empty state messages when no data is available. Style consistently with existing pages using gradient backgrounds and card layouts."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add new route for Profile page at path '/profile' using createRoute with Profile component as the route component. Import Profile component at top of file. Add route to routeTree structure alongside existing routes."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add 'Profile' or 'My Progress' navigation link to both desktop and mobile navigation menus. Position link near Login link. Apply active styling when on /profile route. Ensure link is visible in both navigation modes and follows existing navigation pattern with Link component from TanStack Router."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Update Login page to explain authentication benefits and show status",
      "acceptanceCriteria": [
        "Login page displays benefits of authentication in a prominent section",
        "Benefits list includes: save quiz progress, bookmark careers, track journey",
        "When authenticated, show welcome message with user's principal ID",
        "Provide logout button when authenticated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Login.tsx",
          "operation": "modify",
          "description": "Add benefits section above or beside login form that highlights authentication advantages: save quiz progress, bookmark career paths and degrees, track your journey over time. When user is authenticated (check via useInternetIdentity), display welcome message showing principal ID and add logout button that calls logout function from useInternetIdentity. Hide login form when authenticated. Style benefits list with icons and gradient cards for visual appeal. Maintain existing Internet Identity login integration."
        }
      ]
    }
  ]
}